function ArticleContent() {
    return (
        <div className="article__content">
            <div className="article__image-text">
                <img className="article__image" src="./img/article-photo.jpg" alt="Изображение" />
                <p className="article__text">
                    <span className="article__subtext-wrap">
                        <span className="article__subtext-wrap-span-concept">Вказівники у мові програмування C </span> — це змінні, що зберігають адресу іншої змінної в пам'яті комп'ютера. Вони дозволяють ефективно працювати з великими об'єктами, передавати їх у функції без копіювання даних і навіть створювати динамічні структури даних, такі як списки та дерева.
                    </span>
                </p>
            </div>
            <p className="article__text article__text--long">
                Кожен вказівник має тип, який вказує на тип даних, що зберігаються за цією адресою (наприклад, int* для вказівника на ціле число). Операції з вказівниками включають використання оператора & для отримання адреси змінної та оператора * для доступу до значення за адресою. Вказівники дають можливість ефективно передавати великі об'єкти в функції, створювати динамічні структури, але потребують обережності, щоб уникнути помилок, таких як доступ до неприпустимих областей пам'яті або помилкове розіменування.
            </p>
        </div>
    )
}

export default ArticleContent;